Dlubal.TimberPro.EffectiveLength2
Member or set of members effective length parameters.

Dlubal.TimberPro.EffectiveLength2.No
Member or set of members number

Dlubal.TimberPro.EffectiveLength2.ID
Identifier

Dlubal.TimberPro.EffectiveLength2.Comment
Comment

Dlubal.TimberPro.EffectiveLength2.Tag
Tag

Dlubal.TimberPro.EffectiveLength2.IsValid
Information if the object is valid or not (read only)

Dlubal.TimberPro.EffectiveLength2.Length
Length of member or set of members

Dlubal.TimberPro.EffectiveLength2.EnableBucklingAboutY
Enables/disables buckling about axis y.

Dlubal.TimberPro.EffectiveLength2.BucklingLengthCoefficientY
Buckling about axis y length coefficient kcr,y

Dlubal.TimberPro.EffectiveLength2.EffectiveLengthY
Effective length about axis y Lcr,y

Dlubal.TimberPro.EffectiveLength2.EnableBucklingAboutZ
Enables/disables buckling about axis z.

Dlubal.TimberPro.EffectiveLength2.BucklingLengthCoefficientZ
Buckling about axis z length coefficient kcr,z

Dlubal.TimberPro.EffectiveLength2.EffectiveLengthZ
Effective length about axis z Lcr,z

Dlubal.TimberPro.EffectiveLength2.EnableLTB
Enables/disables lateral-torsional buckling.

Dlubal.TimberPro.EffectiveLength2.EffectiveLateralTorsionalBucklingOption
Option of effective length or critical bending moment for lateral-torsional buckling Lcr / Mcr

Dlubal.TimberPro.EffectiveLength2.LTBLength
Effective length for lateral-torsional buckling Lcr

Dlubal.TimberPro.EffectiveLength2.LTBCriticalMoment
Critical bending moment for lateral-torsional buckling Mcr

Dlubal.TimberPro.EffectiveLength2.EnableUnsupportedLength
Enables/disables unsupported length L

Dlubal.TimberPro.EffectiveLength2.LTBUnsupportedLength
Unsupported length for effective length Lcr

Dlubal.TimberPro.EffectiveLength2.OptionEffectiveLTBLengthAccordingToTable61
Option of effective length for bending members according to table 6.1